onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/КатегорииВыработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КатегорииВыработки</Name>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>бит_омни_ТипЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_омни_ТипыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДлительностьПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_омни_ТелефонДляЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_омни_НеВыгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_омни_ИконкаСпециализации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_омни_ИконкиСпециализаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_омни_НаименованиеДляСайта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/КатегорииВыработки/Forms/ФормаЭлементаУпр/Ext/Form/Module.bsl
&НаСервере
Процедура бит_омни_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ГруппаБИТМедицинаОмни = Элементы.Вставить("бит_омни_ГруппаЭлементов", Тип("ГруппаФормы"), ЭтотОбъект, Элементы.ГруппаСтраницы);
	ГруппаБИТМедицинаОмни.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаБИТМедицинаОмни.Заголовок = "БИТ.Медицина / Омни";

	ЭлементНеВыгружать = Элементы.Добавить("бит_омни_НаименованиеДляСайта", Тип("ПолеФормы"), ГруппаБИТМедицинаОмни);
	ЭлементНеВыгружать.ПутьКДанным = "Объект.бит_омни_НаименованиеДляСайта";
	ЭлементНеВыгружать.Вид = ВидПоляФормы.ПолеВвода;

	ЭлементТипЗаписи = Элементы.Добавить("бит_омни_ТипЗаписи", Тип("ПолеФормы"), ГруппаБИТМедицинаОмни);
	ЭлементТипЗаписи.ПутьКДанным = "Объект.бит_омни_ТипЗаписи";
	ЭлементТипЗаписи.Вид = ВидПоляФормы.ПолеВвода;
	
	ЭлементТелефонДляЗаписи = Элементы.Добавить("бит_омни_ТелефонДляЗаписи", Тип("ПолеФормы"), ГруппаБИТМедицинаОмни);
	ЭлементТелефонДляЗаписи.ПутьКДанным = "Объект.бит_омни_ТелефонДляЗаписи";
	ЭлементТелефонДляЗаписи.Вид = ВидПоляФормы.ПолеВвода;
	
	ЭлементНеВыгружать = Элементы.Добавить("бит_омни_ИконкаСпециализации", Тип("ПолеФормы"), ГруппаБИТМедицинаОмни);
	ЭлементНеВыгружать.ПутьКДанным = "Объект.бит_омни_ИконкаСпециализации";
	ЭлементНеВыгружать.Вид = ВидПоляФормы.ПолеВвода;
	
	ЭлементНеВыгружать = Элементы.Добавить("бит_омни_НеВыгружать", Тип("ПолеФормы"), ГруппаБИТМедицинаОмни);
	ЭлементНеВыгружать.ПутьКДанным = "Объект.бит_омни_НеВыгружать";
	ЭлементНеВыгружать.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементНеВыгружать.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право; 
	
КонецПроцедуры
